// --- Приклад 1 --- 
'number' + 3 + 3
//'number' + 3 'number3'
// 'number3' + 3 'number33'
// Результат:
'number33'
// Оператор + з рядком, завжди виконує конкатенація

// --- Приклад 2 ---
null + 3
// null у числовому контексті перетворюється на 0
// 0 + 3 = 3
// Результат:
3
// null в арефметичних операціях стає 0

// --- Приклад 3 ---
5 && "qwerty"
// 5 — truthy, тому оператор && повертає другий операнд
// Результат:
"qwerty"

// --- Приклад 4 ---
+ '40' + + '2' + "hillel"
40 + 2 + "hillel" // Унарний плюс перетворює, рядок у число
//40 + 2 = 42
// 42 + "hillel"  "42hillel" число + рядок = рядок
// Результат:
"42hillel"

// --- Приклад 5 ---
'10' - 5 === 6
// Крок 1: оператор "-" завжди перетворює рядок на число
// '10' → 10
// Крок 2: віднімання
//10 - 5 перетворює5
// Крок 3: порівняння зі строгою рівністю
//5 === 6 перетворює false
// Результат:
false

// --- Приклад 6 ---
true + false
1 + 0 // true = 1 false = 0 в числовому контексті 
// Результат:
1
// Логічні значення в арифметиці претворюються на числа

// --- Приклад 7 ---
'4px' - 3
NaN - 3 // '4px' не може бути перетворенийна число, стає NaN
NaN // Операція з NaN дає NaN
// Рузультат:
NaN
// Рядок який не є числом, при перетворенні дає NaN

// ---Приклад 8 ---
'4' - 3
// '4' успішно претворюється на число 4
// 4 - 3 = 1
// Результат:
1
// Рядок з числом успішно перетворюється на число

// --- Приклад 9 ---
'6' + 3 ** 0
'6' + 1 //3 ** 0 = 1 будь-яке число в степені 0
//'6' + 1 → "61"
'61' // Конкатенація рядка '6' та числа 1
// Результат:
'61'
// Виконується піднесення до степеня **, потім додавання

// --- Приклад 10 ---
12 / '6'
12 / 6 // '6' перетворюється на 6
// 12 / 6 = 2
// Результат:
2
// Оператори ділення, завжди перетворює операнди на числа

// --- Приклад 11 ---
'10' + (5 === 6)
// 5 === 6 дає false
//'10' + false перетворює "10false" конкатенація
// Результат:
"10false"
// Булеві значення при конкостенації пертворюються на рядок

// --- Приклад 12 ---
null == ''
false // null дорівнює лише undefined при нестрогому порівнянні
// Результат:
false

// --- Приклад 13 ---
3 ** (9 / 3)
3 ** 3 // 9 / 3 = 3
27 // 3 = 27
// Результат:
27
// Спочатку виконуються операції в дужках

// --- Приклад 14 ---
!!'false' == !!'true'
!!'false' == !!'true' // Непорожній рядок truthy
true == true // Подвійние заперечення !! перетворює у справжнє булеве
true // true = true
// Результат:
true
// Непорожні рядки завжди truthy

// --- Приклад 15 ---
0 || '0' && 1
0 || 1 // '0' && 1 = 1 обидва значення truthy
1 // 0 || 1 = 1, 0 - false, повертається 1
// Результат:
1
// && має вищий пріорітет ніж ||

// --- Приклад 16 ---
(+null == false) < 1;
(0 == false) < 1 // + null = 0
true < 1 // 0 == false дає true обидва false
1 < 1 // true перетворюються на 1
false // 1 не меньше 1
// Результат:
false
// Порівнянні з числами  true стає 1, false стає 0

// --- Приклад 17 ---
false && true || true
false || true // false && true = false
true //false || true = true
// Результат:
true
// && має вищий пріорітет

// --- Приклад 18 ---
false && (false || true);
false && true // false || true = true
false // false && anything = false
// Результат:
false
// Спочатку використовуємо операцію в дужках

// --- Приклад 19 ---
(+null == false) < 1 ** 5;
(0 == false) < 1 // 1 ** 5 = 1
true < 1 // 0 == false = true
1 < 1 // true = 1
false // 1 не меньше 1
// Результат:
false
// До степеня має найвищий пріорітет